

const categoryStructure = {
  Кабелі: ['Type-C', 'Lightning', 'MicroUSB', 'USB-A', 'Магнітні'],
  Повербанки: [
    'Для телефону',
    'Для планшету',
    'Зарядні станції',
    'Сонячні',
    'Бездротові (MagSafe)',
    'З ліхтариком',
  ],
  Колонки: ['Bluetooth', 'Портативні', 'З підсвіткою', 'Стаціонарні'],
  'Зарядні пристрої': [
    'Мережеві',
    'Автомобільні',
    'Бездротові',
    'З кількома портами',
  ],
  Тримачі: ['В авто', 'На велосипед', 'Магнітні', 'На присосці'],
  Навушники: ['Вакуумні', 'Накладні', 'Bluetooth (TWS)', 'З мікрофоном'],
  Аксесуари: [
    'Перехідники',
    'Картридери',
    'Чохли',
    'Плівки та скло',
    'Селфі-палки',
  ],
  Інше: ['Розетки', 'Ліхтарики', 'Адаптери', 'Тестери кабелів'],
};

export default function HomePage() {
  return (
      <main className="border ">
        
      </main>
    
  );
}
