export interface Brand {
  id: number;
  title: string;
  image: string;
  handle: string;
  description?: string[];
  imageFull: string;
  products?: string[]; // ⬅️ необязательное поле
}
export const brands: Brand[] = [
  {
    id: 1,
    title: 'Ridea',
    image: '/images/brands/ridea.png',
    imageFull: '/images/brands/imagesFull/ridea.jpg',
    handle: 'ridea',
    description: [
      'В розробці своєї продукції компанія Ridea зробила головний фокус на якості збірки та інновативності технологій по доступній ціні, адже це виявляється найголовнішим у результаті для кінцевого споживача.',
      'Завдяки чесній ціні та відмінній якості Ridea з легкістю конкурує з популярними брендами.',
      'Мобільні аксесуари Ridea відрізняються відмінним технічним наповненням. Це той випадок, коли результат перевищує очікування найвибагливіших споживачів.',
    ],
  },
  {
    id: 2,
    title: 'XO',
    image: '/images/brands/xo.jpg',
    imageFull: '/images/brands/imagesFull/XO.jpg',
    handle: 'xo',
    description: [
      "Це відносно молодий китайський бренд, який швидко завоював світ завдяки своєму унікальному екстер'єру та високій якості продукції.",
      'XO brand пропонує фантастичний вибір корисних аксесуарів для власників найрізноманітніших гаджетів. Вся продукція створюється на сучасному автоматизованому обладнанні та відповідає європейським стандартам.',
      'Найуспішнішими позиціями каталогу є:',
    ],
    products: [
      'Повнорозмірні ігрові навушники: дротова гарнітура з якісного пластику, амбушури – з екошкіри, з мікрофоном та підсвічуванням, потужність ~30mW.',
      'Автомобільні тримачі телефонів: забезпечують надійну фіксацію смартфона, регулювання кута, ідеальні для GPS.',
      'Портативні Bluetooth колонки: потужність ~10W, підтримка Bluetooth, USB, Micro-SD, AUX, Jack 6.35 мм.',
      'Дротові миші: підсвічуються, виготовлені з пластику і силікону, інтерфейс USB.',
    ],
  },
  {
    id: 3,
    title: 'Baseus',
    image: '/images/brands/baseus.png',
    imageFull: '/images/brands/imagesFull/baseus.webp',
    handle: 'baseus',
    description: [
      'Baseus був заснований в 2011 році, як бренд побутової і мобільної електроніки, компанією Shenzhen Times Innovation Technology Co. Ltd., яка займається розробкою дизайну, дослідженнями, виробництвом і продажем продукції Baseus. Також, Бренд Baseus був сформований на основі слогану, який використовує компанія «Base on user» (перекладається як: «На основі користувача») - це говорить про те, що компанія, при щоденній роботі, думає виходячи з потреб користувачів і розробляє продукти з високою практичною та естетичною цінністю.',
      'Стійке зростання і розвиток компанії протягом 10 років дозволили Baseus стати провідним підприємством в галузі побутової і мобільної електроніки в Китаї. Компанія незмінно дотримується філософії, яка полягає в практичній естетиці та інноваціях в дизайні. В процесі розробки нових продуктів, Baseus приділяє особливу увагу впровадженню нових технологій і використанню екологічно чистих матеріалів, в той же час інтегрує в продукт стильні елемент',
    ],
  },
  {
    id: 4,
    title: 'Borofone',
    image: '/images/brands/borofone.jpg',
    imageFull: '/images/brands/imagesFull/borofone.jpg',
    handle: 'borofone',
    description: [
      'Borofone — це бренд аксесуарів для мобільних пристроїв, який є дочірнім підприємством компанії HOCO Technology (Hong Kong) Co., Ltd. Бренд був заснований у 2011 році і спеціалізується на виробництві високоякісних аксесуарів для цифрових пристроїв, включаючи аудіопристрої, зарядні пристрої, кабелі, мобільні акумулятори та автоаксесуари. Borofone прагне пропонувати доступні, але якісні продукти для користувачів у всьому світi',
    ],
  },
  {
    id: 5,
    title: 'Celebrat',
    image: '/images/brands/Celebrat.png',
    imageFull: '/images/brands/imagesFull/Celebrat.jpg',
    handle: 'celebrat',
    description: [
      'Молодий китайський бренд "Celebrat" тому приклад. Засновники торгової марки не довго думали над її назвою - відкинули від англійського слова "celebrate" (святкувати) останню букву і зосередилися на якості продукції. І "святкування" вдалося! Поки ще не культовий, але вже досить відомий бренд мобільних аксесуарів "Celebrat" упевнено прокладає дорогу на торгові вітрини країн Азії, Близького Сходу і старенької Європи',
      '"Успіх приходить до тих, хто уважний до дрібниць" - вирішили в "Celebrat" і направили всі ресурси на розробку цих самих дрібниць. Головною продукцією торгової марки є:',
    ],
    products: ['гарнітури для мобільних телефонів', 'кабелі синхронізації'],
  },
  {
    id: 6,
    title: 'Fantech',
    image: '/images/brands/fantech.png',
    imageFull: '/images/brands/imagesFull/fantech.jpg',
    handle: 'fantech',
    description: [
      "Це компанія, відома як виробник ігрової периферії та комп'ютерних аксесуарів. Вона була заснована в 2009 році і швидко розширила свою присутність на ринку, пропонуючи широкий асортимент продукції для геймерів. ",
      'Fantech звертає увагу на дизайн, технічні характеристики та доступну ціну, що робить її продукцію популярною.',
    ],
  },
  {
    id: 7,
    title: 'Hoco',
    image: '/images/brands/hoco.png',
    imageFull: '/images/brands/imagesFull/hoco.jpg',
    handle: 'hoco',
    description: [
      'Компанія надає широкий асортимент цифрових аксесуарів і товарів для щоденного життя, включаючи різні категорії товарів. Основной акцент компанії hoco. зроблено на якість продукції, і вона прагне створити прості, практичні, стильні та яскраві товари.',
      'Компанія планує продовжувати підтримувати цей принцип.',
    ],
  },
  {
    id: 8,
    title: 'Inobi',
    image: '/images/brands/inobi.png',
    imageFull: '/images/brands/imagesFull/inobi.jpg',
    handle: 'inobi',
    description: [
      'iNobi - українська компанія, яка з 2022 року спеціалізується на розробці та виробництві захисних плівок та стекол для екранів смартфонів, планшетів та ноутбуків. Вони відомі своїм плотером iNobi CUT-1 та різноманітністю плівок, а також представили нові моделі плоттерів та лінійки скла. ',
    ],
  },
];
